Revit 2024 API
BuiltInFailures.CuttingFailures Class
 Failures about Cutting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class CuttingFailures
Visual Basic
Public NotInheritable Class CuttingFailures
Visual C++
public ref class CuttingFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.CuttingFailures
See Also
BuiltInFailures.CuttingFailures Members
Autodesk.Revit.DB Namespace